# -*- coding: utf-8 -*-
"""6 номер.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1rsYQiqJmaK65tHqqqRIuny-J52Fv06U5

**Лабораторная работа 1**

Выполнила: Гафурова Н.А     
Группа: ЦИБ-251

**№ 1.6**

Дано уравнение ax + b = 0 и отрезок [m;n]. Ответьте на вопрос, попадает ли
решение уравнения в указанный отрезок.
Решение (начало и общий ход мыслей):
1. Аналитическое решение.
Коэффициенты уравнения и величина отрезка - произвольны,
возьмем целые числа. Решение x при этом может быть дробным.
После определения x составим логическое выражение попадания в
отрезок, что и будет ответом.
2. Алгоритм.
3. - ввести все неизвестные величины;
4. - определить корень уравнения;
5. - составить логическое выражение попадания корня в область;
6. - вывести результат попадания на экран.
"""

# Задание task_01_06.

a = int(input())       #ввод данных
b = int(input())
m = int(input())
n = int(input())

x = -b/a               #решение уравнения

is_ok = m <= x <= n    #диапазон

print("Попадает:", is_ok)


# --------------
# Пример вывода:
#
# Введите a = 1
# Введите b = 2
# Введите m = -5
# Введите n = 5
# Попадает: True